talelas/Elyssa-dev-board--test-continous-deployement/elyssa-arduino/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter

##############################################################

elyssa.name=Elyssa 

elyssa.bootloader.tool=esptool_py
elyssa.bootloader.tool.default=esptool_py

elyssa.upload.tool=esptool_py
elyssa.upload.tool.default=esptool_py
elyssa.upload.tool.network=esp_ota

elyssa.upload.maximum_size=3342336
elyssa.upload.maximum_data_size=327680
elyssa.upload.flags=
elyssa.upload.extra_flags=
elyssa.upload.use_1200bps_touch=false
elyssa.upload.wait_for_upload_port=false

elyssa.serial.disableDTR=false
elyssa.serial.disableRTS=false

elyssa.build.tarch=xtensa
elyssa.build.bootloader_addr=0x0
elyssa.build.target=esp32s3
elyssa.build.mcu=esp32s3
elyssa.build.core=esp32
elyssa.build.variant=elyssa
elyssa.build.board=ESP32S3_DEV

elyssa.build.usb_mode=1
elyssa.build.cdc_on_boot=1
elyssa.build.msc_on_boot=0
elyssa.build.dfu_on_boot=0
elyssa.build.f_cpu=240000000L
elyssa.build.flash_size=8MB
elyssa.build.flash_freq=80m
elyssa.build.flash_mode=dio
elyssa.build.boot=qio
elyssa.build.boot_freq=80m
elyssa.build.partitions=default_8MB
elyssa.build.defines=
elyssa.build.loop_core=-DARDUINO_RUNNING_CORE=1
elyssa.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
elyssa.build.psram_type=qspi
elyssa.build.memory_type={build.boot}_{build.psram_type}

# PSRAM — FN8 has NO external PSRAM. Disabled must use qspi type
# so the linker finds qio_qspi precompiled libs, but no PSRAM
# is actually initialized because BOARD_HAS_PSRAM is not defined.
elyssa.menu.PSRAM.disabled=Disabled (FN8 default)
elyssa.menu.PSRAM.disabled.build.defines=
elyssa.menu.PSRAM.disabled.build.psram_type=qspi

# Flash Mode — FN8 internal flash supports QIO
elyssa.menu.FlashMode.qio=QIO 80MHz (recommended)
elyssa.menu.FlashMode.qio.build.flash_mode=dio
elyssa.menu.FlashMode.qio.build.boot=qio
elyssa.menu.FlashMode.qio.build.boot_freq=80m
elyssa.menu.FlashMode.qio.build.flash_freq=80m
elyssa.menu.FlashMode.dio=DIO 80MHz
elyssa.menu.FlashMode.dio.build.flash_mode=dio
elyssa.menu.FlashMode.dio.build.boot=dio
elyssa.menu.FlashMode.dio.build.boot_freq=80m
elyssa.menu.FlashMode.dio.build.flash_freq=80m

# Flash Size — FN8 has exactly 8MB, no other option needed
elyssa.menu.FlashSize.8M=8MB (64Mb) — FN8
elyssa.menu.FlashSize.8M.build.flash_size=8MB

# Partition Scheme
elyssa.menu.PartitionScheme.default_8MB=8MB with SPIFFS (3MB APP / 1.5MB SPIFFS)
elyssa.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
elyssa.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
elyssa.menu.PartitionScheme.huge_app=Huge APP (7.5MB No OTA)
elyssa.menu.PartitionScheme.huge_app.build.partitions=huge_app
elyssa.menu.PartitionScheme.huge_app.upload.maximum_size=7667712
elyssa.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP / OTA)
elyssa.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
elyssa.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

# CPU Frequency
elyssa.menu.CPUFreq.240=240MHz (WiFi)
elyssa.menu.CPUFreq.240.build.f_cpu=240000000L
elyssa.menu.CPUFreq.160=160MHz (WiFi)
elyssa.menu.CPUFreq.160.build.f_cpu=160000000L
elyssa.menu.CPUFreq.80=80MHz
elyssa.menu.CPUFreq.80.build.f_cpu=80000000L

# USB Mode
elyssa.menu.USBMode.default=USB-OTG (TinyUSB)
elyssa.menu.USBMode.default.build.usb_mode=0
elyssa.menu.USBMode.hwcdc=Hardware CDC and JTAG
elyssa.menu.USBMode.hwcdc.build.usb_mode=1

# CDC On Boot
elyssa.menu.CDCOnBoot.cdc=Enabled
elyssa.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
elyssa.menu.CDCOnBoot.default=Disabled
elyssa.menu.CDCOnBoot.default.build.cdc_on_boot=0

# MSC On Boot
elyssa.menu.MSCOnBoot.default=Disabled
elyssa.menu.MSCOnBoot.default.build.msc_on_boot=0
elyssa.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
elyssa.menu.MSCOnBoot.msc.build.msc_on_boot=1

# DFU On Boot
elyssa.menu.DFUOnBoot.default=Disabled
elyssa.menu.DFUOnBoot.default.build.dfu_on_boot=0
elyssa.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
elyssa.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

# Upload Mode
elyssa.menu.UploadMode.default=UART0 / Hardware CDC
elyssa.menu.UploadMode.default.upload.use_1200bps_touch=false
elyssa.menu.UploadMode.default.upload.wait_for_upload_port=false
elyssa.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
elyssa.menu.UploadMode.cdc.upload.use_1200bps_touch=true
elyssa.menu.UploadMode.cdc.upload.wait_for_upload_port=true

# Core Affinity
elyssa.menu.LoopCore.1=Core 1
elyssa.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
elyssa.menu.LoopCore.0=Core 0
elyssa.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

elyssa.menu.EventsCore.1=Core 1
elyssa.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
elyssa.menu.EventsCore.0=Core 0
elyssa.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

# Upload Speed
elyssa.menu.UploadSpeed.921600=921600
elyssa.menu.UploadSpeed.921600.upload.speed=921600
elyssa.menu.UploadSpeed.460800=460800
elyssa.menu.UploadSpeed.460800.upload.speed=460800
elyssa.menu.UploadSpeed.115200=115200
elyssa.menu.UploadSpeed.115200.upload.speed=115200

# Debug Level
elyssa.menu.DebugLevel.none=None
elyssa.menu.DebugLevel.none.build.code_debug=0
elyssa.menu.DebugLevel.error=Error
elyssa.menu.DebugLevel.error.build.code_debug=1
elyssa.menu.DebugLevel.info=Info
elyssa.menu.DebugLevel.info.build.code_debug=3
elyssa.menu.DebugLevel.verbose=Verbose
elyssa.menu.DebugLevel.verbose.build.code_debug=5

# JTAG
elyssa.menu.JTAGAdapter.default=Disabled
elyssa.menu.JTAGAdapter.default.build.copy_jtag_files=0
elyssa.menu.JTAGAdapter.builtin=Integrated USB JTAG
elyssa.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
elyssa.menu.JTAGAdapter.builtin.build.copy_jtag_files=1

# Erase Flash
elyssa.menu.EraseFlash.none=Disabled
elyssa.menu.EraseFlash.none.upload.erase_cmd=
elyssa.menu.EraseFlash.all=Enabled
elyssa.menu.EraseFlash.all.upload.erase_cmd=-e